Revit 2024 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeTypeRefsWarning Property
 Cannot create reference objects for a DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateDirectShapeTypeRefsWarning { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateDirectShapeTypeRefsWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateDirectShapeTypeRefsWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace